<template>
  <div class="functional-diagnosticks">

    <div class="functional-diagnosticks__head">
      <div class="head">
        <div class="head__title">
          Отделение функциональной диагностики
        </div>
        <div class="head__subtitle">
          В отделении функциональной диагностики проводятся исследования сердечно-сосудистой и нервной систем
        </div>
      </div>

      <div class="functional-diagnosticks__context">
        <div class="context">

          <div class="context__additionally">
            <div class="additionally">
              <a @click="modal = true">Подготовка пациента к методикам в отделении функциональной диагностики</a>
            </div>
          </div>

          <ul class="context__list list">
            <li 
              v-for="(item, i) in listItems"
              :key="i"
              class="list__item"
            >
              <div class="list__title">
                {{ item.title }}
              </div>
              <p class="list__description">
                {{ item.description }}
              </p>
            </li>

            <li class="list__item">
              <div class="list__title">
                Методики  вызванных потенциалов (ВП)  
              </div>

              <p class="list__description">
                <ul class="list--second">
                  <li>
                    - позволяют выявить повреждение зрительных путей головного мозга на различных уровнях  
                  </li>
                  <li>
                    -  метод зрительных вызванных  потенциалов ( ЗВП );
                  </li>
                  <li>
                    - слуховых путей на центральном и периферическом уровне 
                  </li>
                  <li>
                    – метод акустических стволовых потенциалов (АСВП); Метод эффективен для выявления поражения структур ствола головного мозга при различных патологических процессах (воспалительные заболевания, последствия ОНМК, ЧМТ).
                  </li>
                  <li>
                    - нарушения чувствительных и двигательных путей нервной системы -  метод соматосенсорных вызванных потенциалов (ССВП).
                  </li>
                  <li>
                    Все эти ВП методы   являются хорошей помощью в ранней диагностике такого грозного заболевания, как рассеянный склероз.
                  </li>
                </ul>
              </p>

            </li>
          </ul>

        </div>
      </div>

    </div>
  </div>
</template>

<script>
import Modal from '@/components/Modal'

export default {
  name: 'FuncDiagnostics',
  data: () => ({
    modal: false,
    listItems: [
      {
        title: 'Электрокардиография (ЭКГ)',
        description: `
          является  абсолютно  необходимым  исследованием, которое  должно  быть  выполнено  в  первую  очередь, 
          для  пациентов, предъявляющих  жалобы  на  боли  в  грудной  клетке, сердцебиения, “перебои” в  сердце, 
          эпизоды  потери  сознания  неясной  причины.
        `
      }, 
      {
        title: 'Холтеровское  мониторирование  ЭКГ (ХМ-ЭКГ)',
        description: `
          выполняется  для обнаружение скрытых форм ИБС, преходящих нарушений ритма и проводимости,
          в том числе в ночное время, оценки противоаритмической терапии, оценки работы кардиостимулятора.
          Профессиональный, спортивный отбор. Экспертные вопросы.
        `
      }, 
      {
        title: 'Суточное  мониторирование  артериального  давления (СМАД)',
        description: `
          позволяет  подтвердить  или  исключить  артериальную  гипертонию  в  сомнительных  случаях, 
          доказать  наличие  феномена  “гипертонии  белого  халата”, определить  суточный  ритм  артериального  давления  
          (влияние  на  прогноз  болезни, выбор  оптимального  режима  назначения  анти гипертензивных  препаратов).
        `
      },
      {
        title: 'Тредмил-тест (ТТ)',
        description: `
          (исследование  на  бегущей  дорожке)  позволяет  верифицировать  диагноз  ишемической  болезни  сердца, 
          уточнить  функциональный  класс  стенокардии  напряжения, определить  толерантность  к  физической  нагрузке, 
          выявить  провоцируемые  физической  нагрузкой  аритмии, оценить  реакцию  артериального  давления  на  физическую  нагрузку. 
          Решение трех последних задач абсолютно необходимо для лиц, занимающихся спортом.
        `
      },
      {
        title: 'Электронейромиография (ЭМГ)',
        description: `
          является популярным и очень эффективным диагностическим методом в неврологической практике. 
          Это исследование выявляет повреждение нервов и уточняет его степень и уровень поражения при травмах рук, ног, лица.  
          Часто именно ЭМГ позволяет решить вопрос о необходимости хирургического вмешательства для восстановления поврежденных нервов. 
          Очень результативна ЭМГ в диагностике воспалительных заболеваний периферической нервной и мышечной систем, 
          в диагностике миастении, наследственных нервно-мышечных заболеваний, различных повреждений спинного мозга и его корешков 
          (радикулиты, корешковые синдромы, ишиас, грыжи межпозвонковых дисков, боковой амиотрофический склероз и др. заболевания мотонейронов). 
        `
      },
      {
        title: 'Электроэнцефалография- (ЭЭГ – нейрокартирование)',
        description: `
          проводится при заболеваниях головного мозга, протекающих с изменением электрической активности 
          различных его структур (корковых, подкорковых, стволовых), в том числе: эпилепсия,   эпилептический синдром, 
          посттравматическая энцефалопатия, ишемический и геморрагический инсульты и их последствия, 
          опухоли головного мозга, кисты. Так же необходима после оперативного вмешательства на головном мозге, 
          и его сосудах.  В отделении   проводится компьютерная запись, как более совершенный вариант методики. 
        `
      },
    ]
  }),
  components: {
    Modal
  }
}
</script>