<template>
  <div class="context">

    <div class="context__head">

      <div class="context__subtitle">
        Отделение функциональной диагностики
      </div>
      <div class="context__title">
        В отделении функциональной диагностики проводятся исследования сердечно-сосудистой и нервной систем
      </div>


      <div class="context__information">

        <div class="paragraph">
          <a>Подготовка пациента к методикам в отделении функциональной диагностики</a>
        </div>

        <div 
          class="paragraph" 
          v-for="(item, i) in listItems"
          :key="i"
        >
          <div class="paragraph__title">
            {{ item.title }}
          </div>
          <div class="paragraph__description">
            {{ item.description }}
          </div>
        </div>

      </div>

    </div>
  </div>
</template>

<script>
export default {
  name: 'FuncDiagnostics',
  data: () => ({
    modal: false,
    listItems: [
      {
        title: 'Электрокардиография (ЭКГ)',
        description: `
          является  абсолютно  необходимым  исследованием, которое  должно  быть  выполнено  в  первую  очередь, 
          для  пациентов, предъявляющих  жалобы  на  боли  в  грудной  клетке, сердцебиения, “перебои” в  сердце, 
          эпизоды  потери  сознания  неясной  причины.
        `
      }, 
      {
        title: 'Холтеровское  мониторирование  ЭКГ (ХМ-ЭКГ)',
        description: `
          выполняется  для обнаружение скрытых форм ИБС, преходящих нарушений ритма и проводимости,
          в том числе в ночное время, оценки противоаритмической терапии, оценки работы кардиостимулятора.
          Профессиональный, спортивный отбор. Экспертные вопросы.
        `
      }, 
      {
        title: 'Суточное  мониторирование  артериального  давления (СМАД)',
        description: `
          позволяет  подтвердить  или  исключить  артериальную  гипертонию  в  сомнительных  случаях, 
          доказать  наличие  феномена  “гипертонии  белого  халата”, определить  суточный  ритм  артериального  давления  
          (влияние  на  прогноз  болезни, выбор  оптимального  режима  назначения  анти гипертензивных  препаратов).
        `
      },
      {
        title: 'Тредмил-тест (ТТ)',
        description: `
          (исследование  на  бегущей  дорожке)  позволяет  верифицировать  диагноз  ишемической  болезни  сердца, 
          уточнить  функциональный  класс  стенокардии  напряжения, определить  толерантность  к  физической  нагрузке, 
          выявить  провоцируемые  физической  нагрузкой  аритмии, оценить  реакцию  артериального  давления  на  физическую  нагрузку. 
          Решение трех последних задач абсолютно необходимо для лиц, занимающихся спортом.
        `
      },
      {
        title: 'Электронейромиография (ЭМГ)',
        description: `
          является популярным и очень эффективным диагностическим методом в неврологической практике. 
          Это исследование выявляет повреждение нервов и уточняет его степень и уровень поражения при травмах рук, ног, лица.  
          Часто именно ЭМГ позволяет решить вопрос о необходимости хирургического вмешательства для восстановления поврежденных нервов. 
          Очень результативна ЭМГ в диагностике воспалительных заболеваний периферической нервной и мышечной систем, 
          в диагностике миастении, наследственных нервно-мышечных заболеваний, различных повреждений спинного мозга и его корешков 
          (радикулиты, корешковые синдромы, ишиас, грыжи межпозвонковых дисков, боковой амиотрофический склероз и др. заболевания мотонейронов). 
        `
      },
      {
        title: 'Электроэнцефалография- (ЭЭГ – нейрокартирование)',
        description: `
          проводится при заболеваниях головного мозга, протекающих с изменением электрической активности 
          различных его структур (корковых, подкорковых, стволовых), в том числе: эпилепсия,   эпилептический синдром, 
          посттравматическая энцефалопатия, ишемический и геморрагический инсульты и их последствия, 
          опухоли головного мозга, кисты. Так же необходима после оперативного вмешательства на головном мозге, 
          и его сосудах.  В отделении   проводится компьютерная запись, как более совершенный вариант методики. 
        `
      },
    ]
  }),
  components: {

  }
}
</script>