<template>
  <div class="context">

    <div class="context__head">

      <div class="context__subtitle">
        Отделение ультразвуковой диагностики
      </div>
      <div class="context__title">
        В отделении ультразвуковой диагностики,  выполняются  следующие исследования
      </div>


      <div class="context__information">

        <div 
          class="paragraph" 
          v-for="(item, i) in listItems"
          :key="i"
        >
          <div class="paragraph__title">
            {{ item.title }}
          </div>
          <div class="paragraph__description">
            {{ item.description }}
          </div>
        </div>

      </div>

    </div>
  </div>
</template>

<script>
export default {
  name: 'UltrasoundProcedure',
  data: () => ({
    listItems: [
      { 
        title: 'УЗИ суставов', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'УЗИ срединного и локтевого нервов', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'Эластометрия печени(при себе иметь УЗИ ОБП, противопоказание- жировой гепатоз), Эластометрия щитовидной и молочной железы', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'УЗИ органов гепатобилиарной зоны, желудка и кишечника', 
        description: 'Натощак' 
      },
      { 
        title: 'УЗИ почек', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'УЗИ мочевого пузыря с определением ООМ', 
        description: 'Наполненный мочевой пузырь' 
      },
      { 
        title: 'УЗИ предстательной железы  трансабдоминальное', 
        description: 'Наполненный мочевой пузырь' 
      },
      { 
        title: 'УЗИ предстательной железы  трансректальное', 
        description: 'За 2 часа до исследования очистительная клизма, умеренное наполнение мочевого пузыря' 
      },
      { 
        title: 'УЗИ матки и придатков трансабдоминальное', 
        description: 'Наполненный мочевой пузырь' 
      },
      { 
        title: 'УЗИ матки и придатков трансвагинальное', 
        description: 'Подготовка не тре6уется' 
      },
      { 
        title: 'УЗИ щитовидной железы', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'УЗИ молочной железы', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'УЗИ слюнных желез', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'ЭХО-КС(УЗИ сердца)', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'УЗДГ сосудов:  артерий и вен верхних и нижних конечностей, брахиоцефальных артерий, транскраниальная допплерография брахиоцефальных артерий', 
        description: 'Подготовка не требуется' 
      },
      { 
        title: 'УЗДГ брюшной аорты, почечных артерий,  нижней полой вены, вен портальной системы', 
        description: 'Натощак' 
      }
    ]
  })
}
</script>